tutorials/fluid/turbulentSwirlingAnnulus/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     foamRun;

solver          fluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5e-3;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   1e-3;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;


functions
{
    // Mass flow rate through the inlet (sum of phi; compressible solver ->
    // mass flux) verifies the prescribed massFlow is delivered.
    #includeFunc patchFlowRate(name=inletFlowRate, patch=inlet)
}


// ************************************************************************* //
