tutorials/fluid/turbulentSwirlingAnnulus/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType LES;

LES
{
    model           Smagorinsky;

    turbulence      on;

    printCoeffs     off;

    delta           cubeRootVol;

    cubeRootVol
    {
        deltaCoeff      1;
    }
}


// ************************************************************************* //
